{
  "nodes": [
    {
      "op": "null", 
      "name": "input", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW3c", 
        "hash": "b65e46c4d11dcb09"
      }, 
      "inputs": [
        [
          0, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p0", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p1", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW3c", 
        "kernel_layout": "OIHW3i4o", 
        "hash": "886b855285a7cf00"
      }, 
      "inputs": [
        [
          1, 
          0, 
          0
        ], 
        [
          2, 
          0, 
          0
        ], 
        [
          3, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p2", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p3", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_1", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "d22b02899278485d"
      }, 
      "inputs": [
        [
          4, 
          0, 
          0
        ], 
        [
          5, 
          0, 
          0
        ], 
        [
          6, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p4", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p5", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_2", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "15a13d3fde5b9fea"
      }, 
      "inputs": [
        [
          7, 
          0, 
          0
        ], 
        [
          8, 
          0, 
          0
        ], 
        [
          9, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_strided_slice", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_strided_slice", 
        "hash": "6b4f042f69dff57a"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p6", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p7", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_3", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "cc3370880c0ef019"
      }, 
      "inputs": [
        [
          11, 
          0, 
          0
        ], 
        [
          12, 
          0, 
          0
        ], 
        [
          13, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p8", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p9", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_3_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_3", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "cc3370880c0ef019"
      }, 
      "inputs": [
        [
          14, 
          0, 
          0
        ], 
        [
          15, 
          0, 
          0
        ], 
        [
          16, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate", 
        "hash": "66c399678de3ea3d"
      }, 
      "inputs": [
        [
          17, 
          0, 
          0
        ], 
        [
          14, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p10", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p11", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_4", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "e60adf9cefd50913"
      }, 
      "inputs": [
        [
          18, 
          0, 
          0
        ], 
        [
          19, 
          0, 
          0
        ], 
        [
          20, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_1", 
        "hash": "720ac71791fdb18f"
      }, 
      "inputs": [
        [
          10, 
          0, 
          0
        ], 
        [
          21, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "afdf7f244db34065"
      }, 
      "inputs": [
        [
          22, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p12", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p13", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_5", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "316c7a5194871006"
      }, 
      "inputs": [
        [
          23, 
          0, 
          0
        ], 
        [
          24, 
          0, 
          0
        ], 
        [
          25, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_strided_slice_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_strided_slice_1", 
        "hash": "69164b07568738e7"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p14", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p15", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_6", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_6", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "f7fab2c530c8ceb9"
      }, 
      "inputs": [
        [
          27, 
          0, 
          0
        ], 
        [
          28, 
          0, 
          0
        ], 
        [
          29, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p16", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p17", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_6_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_6", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "f7fab2c530c8ceb9"
      }, 
      "inputs": [
        [
          30, 
          0, 
          0
        ], 
        [
          31, 
          0, 
          0
        ], 
        [
          32, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_2", 
        "hash": "7e8e6a48ec39b1b1"
      }, 
      "inputs": [
        [
          33, 
          0, 
          0
        ], 
        [
          30, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p18", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p19", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_7", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_7", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "760ce96c27c4ae4c"
      }, 
      "inputs": [
        [
          34, 
          0, 
          0
        ], 
        [
          35, 
          0, 
          0
        ], 
        [
          36, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_3", 
        "hash": "b54f81dae05f329c"
      }, 
      "inputs": [
        [
          26, 
          0, 
          0
        ], 
        [
          37, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_1", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "7ea39d4fa8f073b5"
      }, 
      "inputs": [
        [
          38, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p20", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p21", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_8", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_8", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "25154e1bc00fd8d4"
      }, 
      "inputs": [
        [
          39, 
          0, 
          0
        ], 
        [
          40, 
          0, 
          0
        ], 
        [
          41, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_strided_slice_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_strided_slice_2", 
        "hash": "f5563fe0e55f7b84"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p22", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p23", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_9", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_9", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "8a8d63231dc3f8a3"
      }, 
      "inputs": [
        [
          43, 
          0, 
          0
        ], 
        [
          44, 
          0, 
          0
        ], 
        [
          45, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p24", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p25", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_9_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_9", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "8a8d63231dc3f8a3"
      }, 
      "inputs": [
        [
          46, 
          0, 
          0
        ], 
        [
          47, 
          0, 
          0
        ], 
        [
          48, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_4", 
        "hash": "f70eac8eeca6ef71"
      }, 
      "inputs": [
        [
          49, 
          0, 
          0
        ], 
        [
          46, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p26", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p27", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_10", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_10", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "aebe0a7b60433d70"
      }, 
      "inputs": [
        [
          50, 
          0, 
          0
        ], 
        [
          51, 
          0, 
          0
        ], 
        [
          52, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_concatenate_5", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_concatenate_5", 
        "hash": "d3d8d105e5a17179"
      }, 
      "inputs": [
        [
          42, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_max_pool2d_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_max_pool2d_2", 
        "out_layout": "", 
        "layout": "NCHW4c", 
        "hash": "7564e0be0ec833f7"
      }, 
      "inputs": [
        [
          54, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p28", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p29", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_11", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_11", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "e700a1aa77001479"
      }, 
      "inputs": [
        [
          55, 
          0, 
          0
        ], 
        [
          56, 
          0, 
          0
        ], 
        [
          57, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p30", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p31", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_12", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_12", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "9b01c304adf11d4a"
      }, 
      "inputs": [
        [
          58, 
          0, 
          0
        ], 
        [
          59, 
          0, 
          0
        ], 
        [
          60, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p32", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p33", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_13", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_13", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "545accbe5f72c458"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          62, 
          0, 
          0
        ], 
        [
          63, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_1", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW2c", 
        "hash": "ee58cb271a4f088d"
      }, 
      "inputs": [
        [
          64, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p34", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p35", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add", 
        "out_layout": "NCHW3c", 
        "data_layout": "NCHW2c", 
        "kernel_layout": "OIHW2i3o", 
        "hash": "bb3e2765084a5189"
      }, 
      "inputs": [
        [
          65, 
          0, 
          0
        ], 
        [
          66, 
          0, 
          0
        ], 
        [
          67, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_2", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_2", 
        "src_layout": "NCHW3c", 
        "dst_layout": "NCHW", 
        "hash": "ea0f453036497312"
      }, 
      "inputs": [
        [
          68, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p36", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p37", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p38", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p39", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p40", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p41", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p42", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p43", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_14", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_14", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "79911c6ee5650590"
      }, 
      "inputs": [
        [
          61, 
          0, 
          0
        ], 
        [
          76, 
          0, 
          0
        ], 
        [
          77, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_reshape_broadcast_to_reshape_layout_transform_concatenate_ea6238e4552c1bec_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_reshape_broadcast_to_reshape_layout_transform_concatenate_ea6238e4552c1bec_", 
        "src_layout": "NCHW", 
        "dst_layout": "NCHW4c", 
        "hash": "d77004c67104fbbc"
      }, 
      "inputs": [
        [
          78, 
          0, 
          0
        ], 
        [
          53, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p44", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p45", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_15", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_nn_leaky_relu_15", 
        "out_layout": "NCHW4c", 
        "data_layout": "NCHW4c", 
        "kernel_layout": "OIHW4i4o", 
        "hash": "d65ad9eecb7916ca"
      }, 
      "inputs": [
        [
          79, 
          0, 
          0
        ], 
        [
          80, 
          0, 
          0
        ], 
        [
          81, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_3", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_3", 
        "src_layout": "NCHW4c", 
        "dst_layout": "NCHW2c", 
        "hash": "09910c4b358ca29d"
      }, 
      "inputs": [
        [
          82, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p46", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p47", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "3", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_nn_contrib_conv2d_NCHWc_add_1", 
        "out_layout": "NCHW3c", 
        "data_layout": "NCHW2c", 
        "kernel_layout": "OIHW2i3o", 
        "hash": "357d2787e706871e"
      }, 
      "inputs": [
        [
          83, 
          0, 
          0
        ], 
        [
          84, 
          0, 
          0
        ], 
        [
          85, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_layout_transform_4", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "1", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_layout_transform_4", 
        "src_layout": "NCHW3c", 
        "dst_layout": "NCHW", 
        "hash": "bc7e86fe61591060"
      }, 
      "inputs": [
        [
          86, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "null", 
      "name": "p48", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p49", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p50", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p51", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p52", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "p53", 
      "inputs": []
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_strided_slice_strided_slice_strided_slice_concatenate_sigmoid_multiply_sub_aaa45746571c950f_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "14", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_strided_slice_strided_slice_strided_slice_concatenate_sigmoid_multiply_sub_aaa45746571c950f_", 
        "hash": "19e5c9c28b00e4dd"
      }, 
      "inputs": [
        [
          69, 
          0, 
          0
        ], 
        [
          70, 
          0, 
          0
        ], 
        [
          71, 
          0, 
          0
        ], 
        [
          72, 
          0, 
          0
        ], 
        [
          73, 
          0, 
          0
        ], 
        [
          74, 
          0, 
          0
        ], 
        [
          75, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ], 
        [
          88, 
          0, 
          0
        ], 
        [
          89, 
          0, 
          0
        ], 
        [
          90, 
          0, 
          0
        ], 
        [
          91, 
          0, 
          0
        ], 
        [
          92, 
          0, 
          0
        ], 
        [
          93, 
          0, 
          0
        ]
      ]
    }, 
    {
      "op": "tvm_op", 
      "name": "tvmgen_default_fused_strided_slice_strided_slice_strided_slice_concatenate_reshape_transpose_re_39980f7f9ecadf66_", 
      "attrs": {
        "num_outputs": "1", 
        "num_inputs": "2", 
        "flatten_data": "0", 
        "func_name": "tvmgen_default_fused_strided_slice_strided_slice_strided_slice_concatenate_reshape_transpose_re_39980f7f9ecadf66_", 
        "hash": "3954776208d09859"
      }, 
      "inputs": [
        [
          69, 
          0, 
          0
        ], 
        [
          87, 
          0, 
          0
        ]
      ]
    }
  ], 
  "arg_nodes": [
    0, 
    2, 
    3, 
    5, 
    6, 
    8, 
    9, 
    12, 
    13, 
    15, 
    16, 
    19, 
    20, 
    24, 
    25, 
    28, 
    29, 
    31, 
    32, 
    35, 
    36, 
    40, 
    41, 
    44, 
    45, 
    47, 
    48, 
    51, 
    52, 
    56, 
    57, 
    59, 
    60, 
    62, 
    63, 
    66, 
    67, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    80, 
    81, 
    84, 
    85, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93
  ], 
  "heads": [
    [
      94, 
      0, 
      0
    ], 
    [
      95, 
      0, 
      0
    ]
  ], 
  "attrs": {
    "dltype": [
      "list_str", 
      [
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32", 
        "float32"
      ]
    ], 
    "device_index": [
      "list_int", 
      [
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1, 
        1
      ]
    ], 
    "storage_id": [
      "list_int", 
      [
        0, 
        1, 
        2, 
        3, 
        4, 
        5, 
        6, 
        1, 
        7, 
        8, 
        4, 
        1, 
        9, 
        10, 
        11, 
        12, 
        13, 
        1, 
        14, 
        15, 
        16, 
        1, 
        14, 
        11, 
        17, 
        18, 
        1, 
        11, 
        19, 
        20, 
        4, 
        21, 
        22, 
        11, 
        14, 
        23, 
        24, 
        11, 
        4, 
        11, 
        25, 
        26, 
        1, 
        11, 
        27, 
        28, 
        14, 
        29, 
        30, 
        11, 
        4, 
        31, 
        32, 
        11, 
        14, 
        1, 
        33, 
        34, 
        4, 
        35, 
        36, 
        1, 
        37, 
        38, 
        14, 
        4, 
        39, 
        40, 
        41, 
        42, 
        43, 
        44, 
        45, 
        46, 
        47, 
        48, 
        49, 
        50, 
        41, 
        1, 
        51, 
        52, 
        11, 
        1, 
        53, 
        54, 
        11, 
        1, 
        55, 
        56, 
        57, 
        58, 
        59, 
        60, 
        41, 
        11
      ]
    ], 
    "shape": [
      "list_shape", 
      [
        [1, 3, 416, 416], 
        [1, 1, 416, 416, 3], 
        [8, 1, 3, 3, 3, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 208, 208, 4], 
        [16, 8, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 104, 104, 4], 
        [16, 16, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 104, 104, 4], 
        [1, 8, 104, 104, 4], 
        [8, 8, 3, 3, 4, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 104, 104, 4], 
        [8, 8, 3, 3, 4, 4], 
        [1, 8, 1, 1, 4], 
        [1, 8, 104, 104, 4], 
        [1, 16, 104, 104, 4], 
        [16, 16, 1, 1, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 104, 104, 4], 
        [1, 32, 104, 104, 4], 
        [1, 32, 52, 52, 4], 
        [32, 32, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 52, 52, 4], 
        [1, 16, 52, 52, 4], 
        [16, 16, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 52, 52, 4], 
        [16, 16, 3, 3, 4, 4], 
        [1, 16, 1, 1, 4], 
        [1, 16, 52, 52, 4], 
        [1, 32, 52, 52, 4], 
        [32, 32, 1, 1, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 52, 52, 4], 
        [1, 64, 52, 52, 4], 
        [1, 64, 26, 26, 4], 
        [64, 64, 3, 3, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 26, 26, 4], 
        [1, 32, 26, 26, 4], 
        [32, 32, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 26, 26, 4], 
        [32, 32, 3, 3, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 26, 26, 4], 
        [1, 64, 26, 26, 4], 
        [64, 64, 1, 1, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 26, 26, 4], 
        [1, 128, 26, 26, 4], 
        [1, 128, 13, 13, 4], 
        [128, 128, 3, 3, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 13, 13, 4], 
        [64, 128, 1, 1, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 13, 13, 4], 
        [128, 64, 3, 3, 4, 4], 
        [1, 128, 1, 1, 4], 
        [1, 128, 13, 13, 4], 
        [1, 256, 13, 13, 2], 
        [85, 256, 1, 1, 2, 3], 
        [1, 85, 1, 1, 3], 
        [1, 85, 13, 13, 3], 
        [1, 255, 13, 13], 
        [1, 1, 13, 13], 
        [1, 1, 13, 13], 
        [1, 1, 13, 13], 
        [1, 1, 13, 13], 
        [1, 1, 13, 13], 
        [1, 1, 13, 13], 
        [32, 64, 1, 1, 4, 4], 
        [1, 32, 1, 1, 4], 
        [1, 32, 13, 13, 4], 
        [1, 96, 26, 26, 4], 
        [64, 96, 3, 3, 4, 4], 
        [1, 64, 1, 1, 4], 
        [1, 64, 26, 26, 4], 
        [1, 128, 26, 26, 2], 
        [85, 128, 1, 1, 2, 3], 
        [1, 85, 1, 1, 3], 
        [1, 85, 26, 26, 3], 
        [1, 255, 26, 26], 
        [1, 1, 26, 26], 
        [1, 1, 26, 26], 
        [1, 1, 26, 26], 
        [1, 1, 26, 26], 
        [1, 1, 26, 26], 
        [1, 1, 26, 26], 
        [1, 2535, 1, 4], 
        [1, 2535, 80]
      ]
    ]
  }, 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    8, 
    9, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    18, 
    19, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    28, 
    29, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    38, 
    39, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    48, 
    49, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    58, 
    59, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    68, 
    69, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    78, 
    79, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    88, 
    89, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96
  ]
}